app/Controllers/Auth/Login.php

SELECT *
FROM `users`
WHERE `username` = 'altaf'
 LIMIT 1
---
    public function authenticate()
    {
        // Enable detailed error reporting for debugging
        error_reporting(E_ALL);
        ini_set('display_errors', 1);

        $userModel = new UserModel();

        // Get form data
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Find user in database
        $user = $userModel->where('username', $username)->first();