app/Controllers/Admin/Products.php

SELECT *
FROM `products`
SELECT *
FROM `categories`
---
    public function index()
    {
        $products = $this->productModel->findAll();
        $categories = $this->categoryModel->findAll();