app/Controllers/Admin/Users.php

    public function index()
    {
        $users = $this->userModel->findAll();
---
SELECT *
FROM `users`