app/Models/OrderModel.php

SELECT `orders`.*, `users`.`username`, `users`.`email`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC
---
    public function getOrdersWithDetails($status = null)
    {
        $builder = $this->select('orders.*, users.username, users.email')
            ->join('users', 'users.id = orders.user_id')
            ->orderBy('orders.created_at', 'DESC');

        if ($status !== null) {
            $builder->where('orders.status', $status);
        }

        return $builder->findAll();