app/Models/StaffModel.php

SELECT *
FROM `tbl_staff`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function authenticate($email, $password)
    {
        // Get staff member by email
        $staff = $this->where('email', $email)->first();